app/views/orders/_form.html.erb

SELECT `addresses`.* FROM `addresses` WHERE (`addresses`.user_id = 1)
---
	</div>
		<% current_user.addresses.each do |item| %>