app/views/orders/index.html.erb

SELECT `orders`.* FROM `orders`
---
				    <td><%= format "%.2f", order.pay_price %></td>
				    <td><%= order.order_at.strftime('%Y-%m-%d %H:%M:%S') %></td>