app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders`
---
  def index
    @orders = Order.paginate :page => params[:page], :order => 'created_at DESC',:conditions => ['user_id = ?', current_user.id]